Repository: pypi-data/pypi-mirror-375
Catalog: packages/djangocms-stories/djangocms_stories-0.7.3-py3-none-any.whl/djangocms_stories/locale/*/LC_MESSAGES/django.po
Languages: de

source: site
de: Web-Site

source: Select app config
de: App-Einstellung auswählen

source: Select the app config for the new object
de: App-Einstellung für das neue Objekt auswählen

source: Add %s
de: %s hinzufügen

source: Info
de: Informationen

source: Images
de: Beitragsbild

source: Empty
de: Leer

source: Enable comments for selection
de: Kommentare für Auswahl aktivieren

source: Disable comments for selection
de: Kommentare für Auswahl deaktivieren

source: Generic
de: Generisch

source: Notifications
de: Benachrichtigungen

source: Meta
de: Meta-Informationen

source: You can provide plain strings, Post model attribute or method names
de: Strings und Post-Attribute oder -Methoden erlaubt

source: stories config
de: Stories-Konfiguration

source: stories configs
de: Stories-Konfigurationen

source: type
de: Typ

source: instance namespace
de: Namespace

source: application title
de: Name der Anwendung

source: object name
de: Objektbezeichnung

source: default size of full images
de: Standardgröße für Beitragsbilder

source: If left empty the image size will have to be set for every newly created post.
de: Wenn das Feld leer bleibt, muß die Größe für jedes Beitragsbild neu gesetzt werden.

source: default size of thumbnail images
de: Standardgröße für Vorschaubilder

source: If left empty the thumbnail image size will have to be set for every newly created post.
de: Wenn das Feld leer bleibt, muß die Größe für jedes Vorschaubild neu gesetzt werden.

source: Permalink structure
de: Permalink-Struktur

source: Use placeholder and plugins for article body
de: Placeholder und Plugins für Beitrag verwenden

source: Use abstract field
de: Feld "Zusammenfassung" nutzen

source: Enable related posts
de: "Verwandte Beiträge" aktivieren

source: No
de: Nein

source: Yes, from this stories config
de: Ja, aus dieser Stories-Konfiguration

source: Yes, from this site
de: Ja, aus dieser Website

source: Set author by default
de: Autor standardmäßig eintragen

source: Paginate size
de: Beiträge pro Seite

source: When paginating list views, how many articles per page?
de: Anzahl der Beiträge, ab der die Beitragsübersicht in Seiten geteilt wird.

source: Template prefix
de: Vorlagen-Ordner

source: Alternative directory to load the stories templates from
de: Alternativer Ordner, aus dem die Vorlagen für diesen Instanz geladen werden

source: Menu structure
de: Menüstruktur

source: Structure of the django CMS menu
de: Aufbau des Django CMS-Menü

source: Show empty categories in menu
de: Leere Kategorien im Menü anzeigen

source: Show categories with no post attached in the menu
de: Auch Kategorien im Menü anzeigen, zu denen es keine Beiträge gibt

source: Sitemap changefreq
de: Sitemap-Anpassungen

source: Changefreq attribute for sitemap items
de: Anpassungsfrequenz-Einstellung für Sitemap-Einträge

source: Sitemap priority
de: Sitemap-Priorität

source: Priority attribute for sitemap items
de: Prioritäts-Einstellung für Sitemap-Einträge

source: Object type
de: Objekt-Typ

source: Facebook type
de: Facebook-Typ

source: Facebook profile ID
de: Facebook Profil-ID

source: Facebook page URL
de: Facebook Seiten-URL

source: Facebook author URL
de: Facebook Autoren-URL

source: Facebook author
de: Facebook Autor

source: Twitter type
de: Twitter-Typ

source: Twitter site handle
de: Twitter Site-Kennung

source: Twitter author handle
de: Twitter Autoren-Kennung

source: Schema.org type
de: Schema.org-Typ

source: Schema.org author name
de: Schema.org Autorenname

source: Send notifications on post publish
de: Mitteilung bei Beitrags-Veröffentlichungen senden

source: Emits a desktop notification -if enabled- when publishing a new post
de: Wenn aktiviert: Desktop-Mitteilung senden, wenn Beiträge veröffentlicht werden

source: Send notifications on post update
de: Mitteilung bei Aktualisierungen senden

source: Emits a desktop notification -if enabled- when editing a published post
de: Wenn aktiviert: Desktop-Mitteilung senden, wenn Beiträge aktualisiert werden

source: untitled
de: unbenannt

source: New {0}
de: Neue(r) {0}

source: Create a new {0} in {1}
de: Neue(n) {0} in {1} erstellen

source: Preview
de: Vorschau

source: %(object_name)s properties
de: %(object_name)s Eigenschaften

source: All entries
de: Alle Einträge

source: Edit Configuration
de: Einstellungen bearbeiten

source: app. config
de: App-Einstellung

source: Selected story not available any more. Close wizard.
de: Ausgewählte Story ist nicht mehr verfügbar. Wizard schließen.

source: Blog articles on %(site_name)s
de: Blog-Beträge auf %(site_name)s

source: App Config
de: App-Einstellung

source: Select the app config to apply to the new post.
de: App-Einstellung für den neuen Beitrag auswählen.

source: parent
de: übergeordnetes Element

source: created at
de: erstellt am

source: modified at
de: bearbeitet am

source: When selecting a value, the form is reloaded to get the updated default
de: Beim Auswählen eines Wertes wird das Formular neu geladen, um die aktualisierten Standardwerte zu erhalten

source: priority
de: Priorität

source: main image
de: Beitragsbild

source: main image thumbnail
de: Beitragsbild (Vorschau)

source: main image full
de: Beitragsbild (volle Größe)

source: category meta description
de: Meta-Beschreibung Kategorie

source: abstract
de: Zusammenfassung

source: post category
de: Beitragskategorie

source: post categories
de: Beitragskategorien

source: PostCategory (no translation)
de: Beitragskategorie (ohne Übersetzung)

source: author
de: Autor

source: created
de: erstellt

source: last modified
de: zuletzt geändert

source: published since
de: öffentlich seit

source: published until
de: öffentlich bis

source: featured date
de: Vorstellungs-Datum

source: include in RSS feed
de: In RSS-Feed aufnehmen

source: category
de: Kategorie

source: enable comments on post
de: Kommentare zu diesem Beitrag erlauben

source: Site(s)
de: Web-Site(s)

source: Select sites in which to show the post. If none is set it will be visible in all the configured sites.
de: Wähle Web-Sites aus, auf welchen der Post angezeigt wird. Ohne Auswahl sichtbar auf allen konfigurierten Seiten.

source: Type a tag and hit tab, or start typing and select from autocomplete list.
de: Schlagwort eintippen und Tabulator drücken oder Anfang eintippen und aus der Vorschlagsliste auswählen.

source: Related Posts
de: Verwandte Beiträge

source: post
de: Beitrag

source: posts
de: Beiträge

source: Post (no translation)
de: Beitrag (ohne Übersetzung)

source: No title
de: Kein Titel

source: post content
de: Beitragsinhalt

source: post contents
de: Beitragsinhalte

source: language
de: Sprache

source: title
de: Titel

source: subtitle
de: Untertitel

source: post meta description
de: Meta-Beschreibung Beitrag

source: post meta keywords
de: Meta-Stichwörter Beitrag

source: post meta title
de: Meta-Titel Beitrag

source: used in title tag and social sharing
de: Wird als Titel-Schlagwort und für das Teilen auf sozialen Netzwerken genutzt

source: Untitled
de: Unbenannt

source: current site
de: Aktuelle Web-Site

source: Select items from the current site only
de: Nur Einträge der aktuelle Web-Site zulassen

source: Plugin layout
de: Plugin-Vorlage

source: Select plugin layout to load for this instance
de: Wählen Sie die Vorlage für diese Instanz des Plugins

source: entries
de: Einträge

source: The number of latests entries to be displayed.
de: Anzahl der anzuzeigenden letzten Beiträge

source: filter by tag
de: Nach Schlagwort filtern

source: Show only the entries tagged with chosen tags.
de: Nur Beiträge mit dem ausgewählten Schlagwort anzeigen

source: filter by category
de: Nach Kategorie filtern

source: Show only the posts of the chosen categories.
de: Nur die Beiträge der ausgewählten Kategorie anzeigen

source: %s latest posts by tag
de: %s neueste Beiträge nach Schlagwort

source: authors
de: Autoren

source: The number of author entries to be displayed.
de: Die Anzahl der anzuzeigenden Autoren-Beiträge

source: %s latest entries by author
de: %s neueste Beiträge nach Autor

source: Featured posts
de: Hervorgehobene Beiträge

source: generic blog plugin
de: Generisches Blog-Plugin

source: Full date
de: Jahr / Monat / Tag

source: Year / Month
de: Jahr / Monat

source: Category
de: Kategorie

source: Just slug
de: Nur Slug

source: Categories and posts
de: Kategorien und Beiträge

source: Categories only
de: Nur Kategorien

source: Posts only
de: Nur Beiträge

source: None
de: Kein Menü

source: always
de: Fortlaufend

source: hourly
de: Stündlich

source: daily
de: Täglich

source: weekly
de: Wöchentlich

source: monthly
de: Monatlich

source: yearly
de: Jährlich

source: never
de: Nie

source: Article
de: Artikel

source: Latest Blog Articles
de: Letzte Blog-Beiträge

source: Latest Blog Articles - Cache
de: Letzte Blog-Einträge - Cache

source: Author Blog Articles
de: Blog-Beiträge nach Autor

source: Author Blog Articles List
de: Blog-Beitrags-Liste nach Autor

source: Tags
de: Schlagworte

source: Categories
de: Kategorien

source: Archive
de: Archiv

source: Featured Posts
de: Hervorgehobene Beiträge

source: Featured Posts - Cache
de: Hervorgehobene Beiträge - Cache

source: Default template
de: Standard-Vorlage

source: Language
de: Sprache

source: Blog articles
de: Blog-Beiträge

source: No article found.
de: Keinen Beitrag gefunden.

source: Back
de: Zurück

source: previous
de: vorheriger

source: Page
de: Seite

source: of
de: von

source: next
de: nächste

source: read more
de: weiterlesen

source: 1 article
de: Ein Artikel

source: 0 articles
de: 0 Beiträge

source: Authors
de: Autoren

source: No author found.
de: Kein Autor gefunden.

source: Articles by
de: Artikel von

source: No categories found.
de: Keine Kategorien gefunden.

source: Tag
de: Schlagwort
