Repository: pypi-data/pypi-mirror-375
Catalog: packages/djangocms-stories/djangocms_stories-0.7.3.tar.gz/djangocms_stories-0.7.3/djangocms_stories/locale/*/LC_MESSAGES/django.po
Languages: lt, ru

source: site
lt: tinklalapis
ru: сайт

source: Info
lt: Informacija
ru: Информация

source: Images
lt: Paveikslėliai
ru: Изображения

source: SEO
ru: СЕО

source: Enable comments for selection
lt: Įgalinti komentarus pasirinktai daliai
ru: Включить коментарии к выделенному

source: Disable comments for selection
lt: Išjungti komentarus pasirinktai daliai
ru: Выключить коментарии к выделенному

source: Generic
lt: Bendras
ru: Общий

source: Layout
lt: Išdėstymas
ru: Макет

source: Notifications
lt: Pranešimai
ru: Уведомления

source: Sitemap
lt: Tinklalapio žemėlapis
ru: Карта сайта

source: Meta
ru: Мета

source: You can provide plain strings, Post model attribute or method names
lt: Galite pateikti paprasto teksto eilutes, įrašo modelio atributą arba metodo pavadinimus
ru: Вы можете использовать простую строку, атрибут модели статьи или имена методов

source: application title
lt: aplikacijos pavadinimas
ru: название приложения

source: object name
lt: objekto pavadinimas
ru: название объекта

source: If left empty the image size will have to be set for every newly created post.
lt: Jei palikta tuščia, paveiksliuko dydis turės būt pasirinktas kiekvienam naujai kuriamam straipsniui.
ru: Если слева пусто, то размер изображения будет применен к каждому новосозданному изображению

source: If left empty the thumbnail image size will have to be set for every newly created post.
lt: Jei palikta tuščia, piktogramos dydis turės būt pasirinktas kiekvienam naujai kuriamam straipsniui.
ru: Если слева пусто, то этот размер изображения заглушки будет применен к каждому новосозданному изображению

source: Permalink structure
lt: Nuolatinės nuorodos struktūra
ru: Строение постоянной ссылки

source: Use placeholder and plugins for article body
lt: Straipsnio tekstui naudokite rezervuotą vietą ir įskiepiuis
ru: Используйте местозаполнитель и плагины для тела статьи

source: Use abstract field
lt: Naudoti santraukos lauką
ru: Используйте поле краткого описания

source: Enable related posts
lt: Įgalinti susijusius straipsnius
ru: Включить связанные публикации

source: Set author by default
lt: Pagal numatymą nustatyti autorių
ru: Указать автора по умолчанию

source: Paginate size
lt: Puslapiavimo dydis
ru: Разбить на части

source: When paginating list views, how many articles per page?
lt: Kai puslapiuojamas sąrašas, kiek straipsnių atvaizduoti puslapyje?
ru: Сколько статей на страницу вы бы хотели использовать при разбиении её на части.

source: Template prefix
lt: Šablono priešdėlis
ru: Префикс шаблона

source: Menu structure
lt: Meniu struktūra
ru: Структура меню

source: Structure of the django CMS menu
lt: Django CMS meniu struktūra
ru: Структура меню django CMS

source: Show empty categories in menu
lt: Rodyti tuščias kategorijas meniu
ru: Показывать пустые категории в меню

source: Show categories with no post attached in the menu
lt: Rodyti kategorijas be susietų straipsnių meniu
ru: Показывать категории без статей в меню

source: Sitemap changefreq
lt: Tinklalapio medžio keitimo dažnumas
ru: Частота обновления карты сайта

source: Changefreq attribute for sitemap items
lt: Keitimo dažnumo atributas tinklalapio medžio objektams
ru: Атрибут частоты изменения объектов карты сайта

source: Sitemap priority
lt: Tinklalapio medžio prioritetas
ru: Приоритет

source: Priority attribute for sitemap items
lt: Prioriteto atributas tinklalapio medžio objektams
ru: Приоритет атребута для объектов карты сайта

source: Object type
lt: Objekto tipas
ru: Тип объекта

source: Facebook type
lt: Facebook tipas
ru: тип в Facebook

source: Facebook application ID
lt: Facebook aplikacijos ID
ru: ID приложения на Facebook

source: Facebook profile ID
lt: Facebook profilio ID
ru: ID профиля на Facebook

source: Facebook page URL
lt: Facebook puslapio URL
ru: URL страницы на Facebook

source: Facebook author URL
lt: Facebook autoriaus URL
ru: URL автора на Facebook

source: Facebook author
lt: Facebook autorius
ru: автор на Facebook

source: Twitter type
lt: Twitter tipas
ru: тип на Twitter

source: Twitter site handle
lt: Twitter tinklalapio vardas
ru: дескриптор сайта на Twitter

source: Twitter author handle
lt: Twitter autoriaus vardas
ru: дескриптор автора на Twitter

source: Send notifications on post publish
lt: Publikavus straipsnį siųsti pranešimus
ru: Отправлять уведомления после публикации статьи

source: Emits a desktop notification -if enabled- when publishing a new post
lt: Išsiunčia darbalaukio pranešima -jei įgalinta- kai publikuojamas naujas straipsnis
ru: Уведомлять сигналами на рабочем столе, если включено, при публикации новой записи

source: Send notifications on post update
lt: Atnaujinus straipsnį siųsti pranešimus
ru: Отправлять уведомления после публикации

source: Emits a desktop notification -if enabled- when editing a published post
lt: Išsiunčia darbalaukio pranešima -jei įgalinta- kai redaguojamas publikuotas straipsnis
ru: Уведомлять сигналами на рабочем столе, если включено, при редактировании опубликованной записи

source: untitled
lt: be pavadinimo
ru: безымянный

source: New {0}
lt: Naujas {0}
ru: Новых {0}

source: Create a new {0} in {1}
lt: Kurti naują {0} viduje {1}
ru: Создать новых {0} из {1}

source: app. config
lt: aplikacijos nustatymai
ru: настройки приложения

source: Blog articles on %(site_name)s
lt: Tinklaraščio straipsniai %(site_name)s
ru: Статьи блога с сайта: %(site_name)s

source: parent
lt: pirminis elementas
ru: предок

source: created at
lt: sukurta
ru: время создания

source: modified at
lt: redaguota
ru: время изменения

source: main image
lt: pagrindinis paveikslėlis
ru: главная страница

source: main image thumbnail
lt: pagrindinio paveikslėlio miniatiūra
ru: уменьшенная копия главного изображения

source: main image full
lt: pagrindinis paveikslėlis pilnas
ru: Полноразмерное изображение

source: name
lt: pavadinimas
ru: название

source: slug
lt: nuoroda
ru: ЧПУ

source: category meta description
lt: kategorijos meta apibūdinimas
ru: категория мета описания

source: abstract
lt: santrauka
ru: Краткое описание

source: author
lt: autorius
ru: автор

source: created
lt: sukurta
ru: создан(о)

source: last modified
lt: paskutinį kartą redaguota
ru: последние изменения

source: published since
lt: publikuota nuo
ru: опубликовано

source: published until
lt: publikuota iki
ru: опубликовано до

source: featured date
lt: populiarinimo data
ru: избранная дата

source: category
lt: kategorija
ru: категория

source: enable comments on post
lt: įgalinti straipsniui komentarus
ru: Разрешить комментарии к статье

source: Site(s)
lt: Tinklalapis(iai)
ru: Сайт(ы)

source: Select sites in which to show the post. If none is set it will be visible in all the configured sites.
lt: Pasirinkite puslapius kuriuose bus rodomas straipsnis. Jei nepasirinktas nei vienas puslapis, straipsnis bus rodomas visuose puslapiuose.
ru: Выберите сайты на которых будет опубликована статья. Если сайты не выбраны, статья будет опубликована на всех сайтах сразу.

source: Related Posts
lt: Susiję straipsniai
ru: Связанные Публикации

source: title
lt: pavadinimas
ru: Заголовок

source: post meta description
lt: straipsnio meta apibūdinimas
ru: мета-описание статьи

source: post meta keywords
lt: straipsnio meta raktažodžiai
ru: ключевые слова к статье

source: post meta title
lt: straipsnio meta pavadinimas
ru: мета-заголовок к статье

source: used in title tag and social sharing
lt: naudojama pavadinimo žymenoje ir socialiniuose tinkluose
ru: используется в метках и обмене в социальных сетях

source: text
lt: tekstas
ru: текст

source: current site
lt: dabartinis tinklalapis
ru: текущий сайт

source: Select items from the current site only
lt: Pasirinkti objektus tik iš dabartinio tinklalapio
ru: Выбрать записи только из текущего сайта

source: filter by tag
lt: filtruoti pagal žymeną
ru: фильтровать по тегам

source: filter by category
lt: filtruoti pagal kategoriją
ru: фильтровать по категориям

source: authors
lt: autoriai
ru: авторы

source: generic blog plugin
lt: bendras tinklaraščio įskiepis
ru: генерируемый плагин блога

source: Full date
lt: Pilna data
ru: Полная дата

source: Year / Month
lt: Metai / Mėnesis
ru: Год / Месяц

source: Category
lt: Kategorija
ru: Категория

source: Just slug
lt: Tik nuoroda
ru: ЧПУ

source: Categories and posts
lt: Kategorijos ir įrašai
ru: Категории и статьи

source: Categories only
lt: Tik kategorijos
ru: Только категории

source: Posts only
lt: Tik įrašai
ru: Только статьи

source: None
lt: Niekas
ru: Ничего

source: always
lt: visada
ru: всегда

source: hourly
lt: kas valandą
ru: ежечасно

source: daily
lt: kas dieną
ru: ежедневно

source: weekly
lt: kas savaitę
ru: еженедельно

source: monthly
lt: kas mėnesį
ru: ежемесячно

source: yearly
lt: kas metus
ru: ежегодно

source: never
lt: niekada
ru: никогда

source: Blog
lt: Tinklaraštis
ru: Блог

source: Latest Blog Articles
lt: Naujausi tinklaraščio straipsniai
ru: Последние статьи блога

source: Latest Blog Articles - Cache
lt: Paskutiniai tinklaraščio straipsniai - kešas
ru: Последние статьи блога - Кэш

source: Author Blog Articles
lt: Tinklaraščio straipsnių autorius
ru: Автор статей блога

source: Tags
lt: Žymenos
ru: Метки

source: Categories
lt: Kategorijos
ru: Категории

source: Archive
lt: Archyvas
ru: Архив

source: Default template
lt: Numatytasis šablonas
ru: Шаблон по умолчанию

source: No article found.
lt: Nerasta jokių straipsnių.
ru: Не найдено ни одной статьи.

source: Back
lt: Atgal
ru: Назад

source: previous
lt: buvęs
ru: предыдущая

source: Page
lt: Puslapis
ru: Страница

source: of
lt: iš
ru: из

source: next
lt: kitas
ru: следующая

source: read more
lt: skaityti daugiau
ru: читать далее

source: 1 article
lt: %(articles)s straipsnis
ru: %(articles)s статья

source: 0 articles
lt: 0 straipsnių
ru: 0 статей

source: Authors
lt: Autoriai
ru: Авторы

source: Articles by
lt: Straipsniai pagal
ru: Статьи созданы

source: No categories found.
lt: Nerasta jokių kategorijų.
ru: Не найдено ни одной категории.

source: Tag
lt: Žymena
ru: Метка
