Repository: pypi-data/pypi-mirror-375
Catalog: packages/oarepo-requests/oarepo_requests-2.5.7.tar.gz/oarepo_requests-2.5.7/oarepo_requests/translations/*/LC_MESSAGES/messages.po
Languages: cs

source: Waiting for finishing the draft publication request.
cs: Čeká se na vyřízení žádosti o zveřejnění konceptu.

source: Review and publish new version
cs: Zkontrolovat a zveřejnit novou verzi

source: New version submitted for review
cs: Nová verze odeslána ke kontrole

source: New version published
cs: Nová verze zveřejněna

source: New version publication declined
cs: Zveřejnění nové verze zamítnuto

source: New version publication cancelled
cs: Zveřejnění nové verze zrušeno

source: By submitting the new version for review you are requesting the publication of the new version. The draft will become locked and no further changes will be possible until the request is accepted or declined. You will be notified about the decision by email.
cs: Odesláním nové verze ke kontrole žádáte o její publikování. Koncept bude uzamčen a nebude možné provádět další změny, dokud nebude žádost schválena nebo zamítnuta. O rozhodnutí budete informováni e-mailem.

source: Click to immediately publish the new version. The new version will be a subject to embargo as requested in the side panel. Note: The action is irreversible.
cs: Kliknutím okamžitě publikujete novou verzi. Nová verze bude podléhat embargu podle nastavení v postranním panelu. Poznámka: Tato akce je nevratná.

source: Submit for review. After submitting the new version for review, it will be locked and no further modifications will be possible.
cs: Odeslat ke kontrole. Po odeslání nové verze ke kontrole bude uzamčena a nebude možné ji dále upravovat.

source: The new version has been submitted for review. You can now accept or decline the request.
cs: Nová verze byla odeslána ke kontrole. Nyní můžete žádost schválit nebo zamítnout.

source: The new version has been submitted for review. It is now locked and no further changes are possible. You will be notified about the decision by email.
cs: Nová verze byla odeslána ke kontrole. Nyní je uzamčena a není možné provádět další změny. O rozhodnutí budete informováni e-mailem.

source: The new version has been submitted for review.
cs: Nová verze byla odeslána ke kontrole.

source: The new version has been published.
cs: Nová verze byla zveřejněna.

source: Publication of the new version has been declined.
cs: Zveřejnění nové verze bylo zamítnuto.

source: The new version has been cancelled.
cs: Nová verze byla zrušena.

source: Waiting for finishing the new version publication request.
cs: Čeká se na vyřízení žádosti o zveřejnění nové verze.

source: escalated
cs: eskaloval(a)

source: This version tag already exists
cs: Tento štítek verze již existuje.

source: There is already a record version with this version tag.
cs: Verze záznamu s tímto štítkem verze již existuje.

source: There is already a record version with this version tag. Please use a different version tag.
cs: Verze záznamu s tímto štítkem verze již existuje. Použijte prosím jiný štítek verze.

source: All open requests need to be closed.
cs: Všechny otevřené žádosti musí být uzavřeny.

source: No description
cs: Žádný popis

source: Opened by {{creatorName}} on {{created}}.
cs: Otevřeno uživatelem {{creatorName}} dne {{created}}.

source: Expires at: {{- expiringDate}}
cs: Platnost do: {{- expiringDate}}

source: Not submitted
cs: Nepodáno

source: All open requests must be closed first.
cs: Nejprve musí být uzavřeny všechny otevřené žádosti.

source: Cannot %(action)s: %(reason)s
cs: Nelze %(action)s: %(reason)s

source: There is already an open request of %(request_type)s on %(record_id)s.
cs: Na záznamu %(record_id)s již existuje otevřená žádost typu %(request_type)s.

source: Unknown request type %(request_type)s.
cs: Neznámý typ žádosti: %(request_type)s.

source: Receiver for request type %(request_type)s is required but wasn't successfully referenced on record %(record_id)s.
cs: Příjemce pro žádost typu %(request_type)s je vyžadován, ale nebyl úspěšně uveden u záznamu %(record_id)s.

source: Additional keyword arguments:
cs: Další pojmenované argumenty:

source: Trying to create edit request on draft record
cs: Pokus o vytvoření žádosti o úpravu konceptu záznamu

source: Trying to create edit request on record with draft
cs: Pokus o vytvoření žádosti o úpravu záznamu, ke kterému již existuje koncept

source: Trying to create new version request on draft record
cs: Pokus o vytvoření žádosti o novou verzi pro koncept záznamu

source: Trying to create publish request on published record
cs: Pokus o vytvoření žádosti o zveřejnění již zveřejněného záznamu

source: Action could not be performed due to validation request fields validation errors.
cs: Akci nelze provést kvůli chybám při validaci polí požadavku.

source: 💬 New comment on on '{request_title}' for '{topic_title}'
cs: 💬 Nový komentář k '{request_title}' pro '{topic_title}'

source: 💬 New comment on on '{request_title}'
cs: 💬 Nový komentář k '{request_title}'

source: 💬 New comment
cs: 💬 Nový komentář

source: '{user_name}' commented on '{request_title}' for '{topic_title}':
cs: '{user_name}' komentoval(a) žádost '{request_title}' pro '{topic_title}':

source: '{user_name}' commented on '{request_title}':
cs: '{user_name}' komentoval(a) žádost '{request_title}':

source: '{user_name}' commented:
cs: '{user_name}' komentoval(a):

source: Check out the request
cs: Zobrazit žádost

source: @{user_name} commented on '{request_title}'
cs: @{user_name} komentoval(a) žádost '{request_title}'

source: Check out the request: {request_link}
cs: Zobrazit žádost: {request_link}

source: *@{user_name}* commented on *{request_title}*
cs: *@{user_name}* komentoval(a) žádost *{request_title}*

source: Record has validation errors. Please click the 'Edit metadata' button and then try again.
cs: Záznam obsahuje chyby validace. Prosím, klikněte na tlačítko 'Upravit metadata' a poté to zkuste znovu.

source: Recipient: {{receiver}}.
cs: Příjemce: {{receiver}}.

source: Recipient:
cs: Příjemce:

source: No changes detected between versions
cs: Mezi verzemi nebyly zjištěny žádné změny

source: Field
cs: Pole

source: Operation
cs: Operace

source: Old Value
cs: Stará hodnota

source: New Value
cs: Nová hodnota

source: Removed
cs: Odstraněno

source: Unable to parse diff data
cs: Nelze analyzovat rozdíly mezi verzemi

source: There was an error processing the diff data.
cs: Při zpracování rozdílů mezi verzemi došlo k chybě.

source: Added
cs: Přidáno

source: requestEdited
cs: upravil(a) záznam

source: Changed
cs: Změněno

source: Value
cs: Hodnota
