Repository: pypi-data/pypi-mirror-375
Catalog: packages/oarepo-requests/oarepo_requests-2.5.7.tar.gz/oarepo_requests-2.5.7/oarepo_requests/translations/*/LC_MESSAGES/messages.po
Languages: cs

source: status
cs: Stav

source: Create Request
cs: Vytvořit žádost

source: Open dialog for request
cs: Otevřít dialogové okno pro žádost

source: My Requests
cs: Moje žádosti

source: Requests to Approve
cs: Žádosti ke schválení

source: Are you sure?
cs: Jste si jisti?

source: Cancel
cs: Zrušit

source: Create request
cs: Vytvořit žádost

source: Submit request
cs: Odeslat žádost

source: Delete request
cs: Smazat žádost

source: Delete
cs: Smazat

source: Accept request
cs: Přijmout žádost

source: Accept
cs: Přijmout

source: Decline request
cs: Zamítnout žádost

source: Decline
cs: Zamítnout

source: Create and submit request
cs: Vytvořit a odeslat žádost

source: Create and submit
cs: Vytvořit a odeslat

source: Error sending request
cs: Chyba při odesílání žádosti

source: Submit
cs: Odeslat

source: Save drafted request
cs: Uložit koncept žádosti

source: Save
cs: Uložit

source: Create
cs: Vytvořit

source: Creator
cs: Tvůrce

source: Receiver
cs: Příjemce

source: Request type
cs: Typ žádosti

source: Created
cs: Vytvořena

source: Timeline
cs: Časová osa

source: Submit event
cs: Odeslat událost

source: No requests to show
cs: Žádné žádosti k zobrazení

source: api.requests
cs: API pro žádosti záznamu

source: Request deletion of published record
cs: Žádost o smazání zveřejněného záznamu

source: Request re-opening of published record
cs: Žádost o znovuotevření zveřejněného záznamu

source: Request publishing of a draft
cs: Žádost o kontrolu a zveřejnění konceptu

source: No status
cs: Beze stavu

source: Cannot send request. Please try again later.
cs: Nemohu poslat žádost. Prosím, zkuste později.

source: Cancel request
cs: Zrušit žádost

source: Submitted
cs: Odeslána

source: Expired
cs: Expirována

source: Accepted
cs: Přijata

source: Declined
cs: Zamítnuta

source: Cancelled
cs: Zrušena

source: Status
cs: Stav

source: Type
cs: Typ

source: Loading request types
cs: Načítám typy žádostí

source: Error loading request types
cs: Chyba při načítání typů žádostí

source: No new requests to create
cs: Nejsou dostupné žádné žádosti

source: Requests
cs: Žádosti

source: Error loading requests
cs: Chyba při načítání žádostí

source: Loading requests
cs: Načítám žádosti

source: Delete record
cs: Smazat záznam

source: Edit record
cs: Upravit záznam

source: Publish draft
cs: Publikovat

source: Close
cs: Zavřít

source: Request
cs: Žádost

source: Pending
cs: Schvalována

source: request
cs: žádost

source: Error while submitting comment.
cs: Chyba při odesílání komentáře.

source: Add comment
cs: Přidat komentář

source: optional
cs: nepovinné

source: Your comment here...
cs: Váš komentář...

source: Comment was not created successfully.
cs: Komentář nebyl úspěšně vytvořen.

source: Comment
cs: Komentář

source: Error while submitting the comment
cs: Chyba při odesílání komentáře

source: Back to requests
cs: Zpět na žádosti

source: Record
cs: Záznam

source: preview
cs: náhled

source: to top
cs: na začátek stránky

source: Loading timeline...
cs: Načítám časovou osu...

source: Error while fetching timeline events
cs: Chyba při načítání událostí časové osy

source: commented
cs: komentoval

source: icon
cs: ikona

source: this request
cs: tato žádost

source: Comment must be at least 1 character long.
cs: Komentář musí být alespoň 1 znak dlouhý.

source: Invalid format.
cs: Neplatný formát.

source: Request status
cs: Stav žádosti

source: Request record deletion
cs: Zažádat o smazání záznamu

source: Record deletion requested
cs: Zažádáno o smazání záznamu

source: Click to permanently delete the record.
cs: Klikněte pro trvalé smazání záznamu.

source: Request permission to delete the record.
cs: Požádejte o povolení ke smazání záznamu.

source: Permission to delete record requested. You will be notified about the decision by email.
cs: Zažádáno o povolení k smazání záznamu. O rozhodnutí budete informováni e-mailem.

source: You have been asked to approve the request to permanently delete the record. You can approve or reject the request.
cs: Byl jste požádán o schválení žádosti o trvalé smazání záznamu. Můžete žádost schválit nebo zamítnout.

source: Permission to delete record (including files) requested.
cs: Zažádáno o povolení ke smazání záznamu (včetně souborů).

source: Submit request to get permission to delete the record.
cs: Odeslat žádost o povolení ke smazání záznamu.

source: Request edit access
cs: Požádat o úpravu záznamu

source: Edit access requested
cs: Zažádáno o úpravu záznamu

source: Click to start editing the metadata of the record.
cs: Klikněte pro zahájení úprav metadat záznamu.

source: Request edit access to the record. You will be notified about the decision by email.
cs: Žádost o úpravu záznamu. O rozhodnutí budete informováni e-mailem.

source: Edit access requested. You will be notified about the decision by email.
cs: Zažádáno o úpravu záznamu. O rozhodnutí budete informováni e-mailem.

source: You have been requested to grant edit access to the record.
cs: Byli jste požádáni o udělení práva na úpravu záznamu.

source: Edit access requested.
cs: Zažádáno o úpravu záznamu.

source: New Version
cs: Nová verze

source: Request requesting creation of new version of a published record.
cs: Žádost o vytvoření nové verze zveřejněného záznamu.

source: Request new version access
cs: Požádat o vytvoření nové verze

source: New version access requested
cs: Zažádáno o vytvoření nové verze

source: Click to start creating a new version of the record.
cs: Klikněte pro zahájení vytváření nové verze záznamu.

source: Request permission to update record (including files). You will be notified about the decision by email.
cs: Požádejte o povolení k aktualizaci záznamu (včetně souborů). O rozhodnutí budete informováni e-mailem.

source: Permission to update record (including files) requested. You will be notified about the decision by email.
cs: Zažádáno o povolení k aktualizaci záznamu (včetně souborů). O rozhodnutí budete informováni e-mailem.

source: You have been asked to approve the request to update the record. You can approve or reject the request.
cs: Byl jste požádán o schválení žádosti o aktualizaci záznamu. Můžete žádost schválit nebo zamítnout.

source: Permission to update record (including files) requested.
cs: Zažádáno o povolení k aktualizaci záznamu (včetně souborů).

source: Submit request to get edit access to the record.
cs: Odeslat žádost o povolení aktualizace záznamu (včetně souborů).

source: Resource version
cs: Verze záznamu

source: Write down the version (first, second…).
cs: Napište verzi (první, druhá…).

source: Submit for review
cs: Odeslat ke kontrole

source: Submitted for review
cs: Odesláno ke kontrole

source: Click to immediately publish the draft. The draft will be a subject to embargo as requested in the side panel. Note: The action is irreversible.
cs: Klikněte pro okamžité zveřejnění konceptu. Bylo-li zvoleno, záznam může podléhat embargu. Upozornění: Tuto akci není možno vzít zpět.

source: By submitting the draft for review you are requesting the publication of the draft. The draft will become locked and no further changes will be possible until the request is accepted or declined. You will be notified about the decision by email.
cs: Odesláním konceptu ke kontrole žádáte o zveřejnění konceptu. Koncept bude uzamčen a další změny nebudou možné, dokud nebude žádost přijata nebo zamítnuta. O rozhodnutí budete informováni e-mailem.

source: The draft has been submitted for review. It is now locked and no further changes are possible. You will be notified about the decision by email.
cs: Koncept byl odeslán ke kontrole. Nyní je uzamčen a další změny nejsou možné. O rozhodnutí budete informováni e-mailem.

source: The draft has been submitted for review. You can now accept or decline the request.
cs: Koncept Vám byl odeslán ke kontrole. Žádost můžete přijmout nebo zamítnout.

source: The draft has been submitted for review.
cs: Koncept byl odeslán ke kontrole.

source: Submit for review. After submitting the draft for review, it will be locked and no further modifications will be possible.
cs: Odeslat ke kontrole. Po odeslání konceptu ke kontrole bude záznam uzamčen a další změny nebudou možné.

source: Request not yet submitted.
cs: Žádost zatím nebyla odeslána.

source: Delete draft
cs: Smazat koncept

source: Request draft deletion
cs: Zažádat o smazání konceptu

source: Draft deletion requested
cs: Zažádáno o smazání konceptu

source: Click to permanently delete the draft.
cs: Klikněte pro trvalé smazání konceptu.

source: Request permission to delete the draft.
cs: Požádejte o povolení ke smazání konceptu.

source: Permission to delete draft requested. You will be notified about the decision by email.
cs: Zažádáno o povolení ke smazání konceptu. O rozhodnutí budete informováni emailem.

source: You have been asked to approve the request to permanently delete the draft. You can approve or reject the request.
cs: Byli jste požádáni o schválení žádosti o trvalé smazání konceptu. Můžete žádost schválit nebo zamítnout.

source: Permission to delete draft (including files) requested.
cs: Zažádáno o povolení ke smazání konceptu (včetně souborů).

source: Submit request to get permission to delete the draft.
cs: Odeslat žádost o povolení ke smazání konceptu.

source: Request not created successfully. Please try again in a moment.
cs: Žádost nebyla úspěšně vytvořena. Zkuste to prosím za chvíli znovu.

source: Form fields could not be fetched.
cs: Formulářová pole nebyla načtena.

source: Request details
cs: Podrobnosti žádosti

source: Topic
cs: Téma

source: Request topic
cs: Téma žádosti

source: Are you sure you want to proceed? Once the action is completed, it will not be possible to undo it.
cs: Jste si jisti, že chcete pokračovat? Po dokončení akce ji nebude možné vrátit zpět.

source: Proceed
cs: Pokračovat

source: Are you sure you wish to proceed? After this request is accepted, it will not be possible to reverse the action.
cs: Jste si jisti, že chcete pokračovat? Po přijetí této žádosti nebude možné akci zvrátit.

source: The request could not be created due to validation errors. Please correct the errors and try again.
cs: Žádost nemohla být vytvořena kvůli validačním chybám. Prosím opravte chyby a zkuste to znovu.

source: The action could not be executed. Please try again in a moment.
cs: Akce nebyla úspěšně provedena. Zkuste to prosím za chvíli znovu.

source: Record has validation errors. Redirecting to form...
cs: Záznam obsahuje validační chyby. Přesměrování na formulář...

source: Comment was not submitted successfully.
cs: Komentář nebyl úspěšně odeslán.

source: Leave comment
cs: Zanechat komentář

source: Request deletion of draft
cs: Zažádat o smazání konceptu

source: It is highly recommended to provide an explanation for the rejection of the request. Note that it is always possible to provide explanation later on the request timeline.
cs: Důrazně doporučujeme poskytnout vysvětlení zamítnutí žádosti. Všimněte si, že je vždy možné poskytnout vysvětlení později v rámci časové osy žádosti.

source: Record preview
cs: Náhled záznamu

source: This action is irreversible. Are you sure you wish to accept this request?
cs: Tato akce je nevratná. Opravdu si přejete tuto žádost přijmout?

source: requestCreated
cs: vytvořil(a) žádost

source: requestSubmitted
cs: odeslal(a) žádost

source: requestCancelled
cs: zrušil(a) žádost

source: requestAccepted
cs: schválil(a) žádost

source: requestDeclined
cs: zamítl(a) žádost

source: Request expired.
cs: Žádost vypršela

source: requestDeleted
cs: smazal(a) žádost

source: requestCommented
cs: komentoval(a)

source: Permanently delete
cs: Trvale smazat

source: Keep the record
cs: Ponechat záznam

source: Publish
cs: Publikovat

source: Return for correction
cs: Vrátit k opravě

source: api.applicable-requests
cs: API pro vytváření žádostí

source: System user
cs: Systémový uživatel

source: Keep files.
cs: Ponechat soubory.

source: Keep files in the new version?
cs: Ponechat soubory v nové verzi?

source: You do not have permission to delete the draft.
cs: Nemáte právo smazat koncept.

source: You do not have permission to delete the record.
cs: Nemáte právo smazat záznam.

source: You do not have permission to update the record.
cs: Nemáte právo zažádat o aktualizaci záznamu.

source: Edit metadata
cs: Upravit metadata

source: Keep files:
cs: Ponechat soubory:

source: If you choose yes, the current record's files will be linked to the new version of the record. Then you will be able to add/remove files in the form.
cs: Pokud zvolíte ano, soubory aktuálního záznamu budou propojeny s novou verzí záznamu. Poté budete moci přidávat/odstraňovat soubory ve formuláři.

source: No
cs: Ne

source: Yes
cs: Ano

source: Comment was not submitted successfully. Please try again in a moment.
cs: Komentář nebyl úspěšně odeslán. Zkuste to prosím za chvíli znovu.

source: User avatar
cs: Avatar uživatele

source: Actions
cs: Akce

source: Edit
cs: Upravit

source: Comment was not edited successfully. Please try again in a moment.
cs: Komentář nebyl úspěšně upraven. Zkuste to prosím za chvíli znovu.

source: Comment was not deleted successfully. Please try again in a moment.
cs: Komentář nebyl úspěšně smazán. Zkuste to prosím za chvíli znovu.

source: Edited
cs: Upraveno

source: Delete comment
cs: Smazat komentář

source: Are you sure you want to delete this comment?
cs: Opravdu chcete tento komentář smazat?

source: deleted comment
cs: smazaný komentář

source: Remaining characters:
cs: Zbývající znaky:

source: Auto approve
cs: Automaticky schváleno

source: Missing uploaded files. To disable files for this record please mark it as metadata-only.
cs: Chybí nahrané soubory. Označte záznam jako 'pouze metadata' pokud je nahrávat neplánujete.

source: Missing uploaded files.
cs: Chybí nahrané soubory.

source: Yes or no
cs: Ano nebo ne

source: Keep files
cs: Ponechat soubory

source: commentTooLong
cs: Váš komentář překročil povolenou délku. Odeberte {{count}} znak.

source: Request could not be executed.
cs: Žádost se nepodařilo provést.

source: The request ({{requestType}}) could not be made due to validation errors. Please fix them and try again:
cs: Validační chyby znemožnily odeslání žádosti ({{requestType}}). Prosím, opravte je a zkuste to znovu:

source: ❗️Delete published request for topic '{topic_id}' accepted
cs: ❗️Žádost o smazání publikovaného tématu '{topic_id}' byla přijata

source: This is an auto-generated message. To manage notifications, visit your
cs: Toto je automaticky generovaná zpráva. Pro správu oznámení navštivte své

source: account settings
cs: nastavení účtu

source: Request for deleting your record '%(topic_id)s' has been accepted.
cs: Žádost o smazání vašeho záznamu '%(topic_id)s' byla přijata.

source: ❗️Request for deletion of topic '{topic_id}' waits for your approval
cs: ❗️Žádost o smazání tématu '{topic_id}' čeká na váš souhlas

source: Request for deletion of record '%(topic_id)s' waits for your approval.
cs: Žádost o smazání záznamu '%(topic_id)s' čeká na váš souhlas.

source: ❗️Publish request for topic '{topic_id}' waits for your approval
cs: ❗️Žádost o publikování tématu '{topic_id}' čeká na váš souhlas

source: Request was escalated to you since the original recipient did not approve the request in time.
cs: Žádost byla eskalována k vám, protože původní příjemce neschválil žádost včas.

source: Publish request for record '%(topic_id)s' waits for your approval.
cs: Žádost o publikování záznamu '%(topic_id)s' čeká na váš souhlas.

source: ❗️Publish request for topic '{topic_id}' accepted
cs: ❗️Žádost o publikování tématu '{topic_id}' byla přijata

source: Request for publishing of your record '%(topic_id)s' has been accepted.
cs: Žádost o publikování vašeho záznamu '%(topic_id)s' byla přijata.

source: Publish new version
cs: Publikovat novou verzi

source: ❗️ Published record has been deleted
cs: ❗️ Vypublikovaný záznam byl smazán

source: The published record has been deleted.
cs: Vypublikovaný záznam byl smazán

source: For more information head to the <a href='%(link)s'>request page</a>.
cs: Více informací naleznete <a href='%(link)s'>na stránce žádosti</a>.

source: For more information head to the %(link)s
cs: Více informací naleznete <a href='%(link)s'>na stránce žádosti</a>.

source: This is an auto-generated message. To manage notifications, visit your account settings
cs: Toto je automaticky generovaná zpráva. Pokud tyto zprávy nechcete nadále dostávat, změňte si nastavení ve svém profilu.

source: ❗️ Request to delete published record {topic_title}
cs: ❗️ Žádost o smazání vypublikovaného záznamu {topic_title}

source: <p> You have been asked to approve deletion of a published record "%(topic_title)s". </p> <p> <a type="button" href='%(link)s'>Accept or Decline the request</a> </p>
cs: <p> Byli jste požádáni o smazání vypublikovaného záznamu "%(topic_title)s". </p> <p> <a type="button" href='%(link)s'>Potvrdit či zamítnout žádost</a> </p>

source: You have been asked to approve deletion of a published record "%(topic_title)s". Accept or Decline the request at %(link)s
cs: Byli jste požádáni o smazání vypublikovaného záznamu "%(topic_title)s" Potvrďte či zamítněte žádost na %(link)s

source: ❗️ A request has been escalated to you
cs: ❗️ Byla Vám eskalována žádost.

source: You can approve or decline the request by visiting the
cs: Můžete zamítnout či potvrdit žádost na

source: request page
cs: stránce žádosti

source: Request was escalated to you since the original recipient did not approve the request in time. You can approve or decline the request by visiting the request page at %(link)s.
cs: Žádost vám byla přiřazena protože původní schvalovatel žádosti včas nezareagoval. Prosím potvrďte či zamítněte žádost na %(link)s.

source: Record '{topic_title}' has been published
cs: Záznam '{topic_title}' byl publikován

source: <p> Your record "%(topic_title)s" has been published. You can see the record at <a href="%(link)s">%(link)s</a> </p>
cs: <p> Váš záznam "%(topic_title)s" byl publikován na adrese <a href="%(link)s">%(link)s</a> </p>

source: Your record "%(topic_title)s" has been published. You can see the record at %(link)s
cs: Váš záznam "%(topic_title)s" byl publikován na adrese %(link)s

source: Request to publish record {topic_title}
cs: Žádost o publikování záznamu {topic_title}

source: <p> You have been asked to publish record "%(topic_title)s". </p> <p> <a type="button" href='%(link)s'>Accept or Decline the request</a> </p>
cs: <p> Byli jste požádáni o publikování záznamu "%(topic_title)s". </p> <p> <a type="button" href='%(link)s'>Přijmout nebo zamítnout žádost</a> </p>

source: You have been asked to publish record "%(topic_title)s". Accept or Decline the request at %(link)s
cs: Byli jste požádáni o publikování záznamu "%(topic_title)s". Přijmout nebo zamítnout žádost na odkazu %(link)s

source: Request for deletion of record '{topic_title}' was declined
cs: Žádost o smazání záznamu '{topic_title}' byla zamítnuta

source: <p> Request for deletion of record "%(topic_title)s" was declined. You can see the request at <a href="%(link)s">%(link)s</a> </p>
cs: <p> Žádost o smazání záznamu "%(topic_title)s" byla zamítnuta. Žádost můžete zobrazit na <a href="%(link)s">%(link)s</a> </p>

source: Request for deletion of record "%(topic_title)s" was declined. You can see the request at %(link)s
cs: Žádost o smazání záznamu "%(topic_title)s" byla zamítnuta. Žádost můžete zobrazit na %(link)s

source: Request for publishing of record '{topic_title}' was declined
cs: Žádost o publikování záznamu '{topic_title}' byla zamítnuta

source: <p> Request for publishing of record "%(topic_title)s" was declined. You can see the request at <a href="%(link)s">%(link)s</a> </p>
cs: <p> Žádost o publikování záznamu "%(topic_title)s" byla zamítnuta. Žádost můžete zobrazit na <a href="%(link)s">%(link)s</a> </p>

source: Request for publishing of record "%(topic_title)s" was declined. You can see the request at %(link)s
cs: Žádost o publikování záznamu "%(topic_title)s" byla zamítnuta. Žádost můžete zobrazit na %(link)s

source: Removal Reason
cs: Důvod smazání

source: Write down the removal reason.
cs: Napište důvod smazání

source: Note
cs: Poznámka

source: Write down the additional note.
cs: Sem můžete napsat poznámku ke smazání

source: Title
cs: Název

source: Record has validation errors. You will have to modify record's metadata and try to make the request again.
cs: Záznam obsahuje validační chyby. Budete muset upravit metadata záznamu a zkusit požadavek znovu.

source: Request to publish a draft
cs: Zažádat o zveřejnění konceptu

source: Publish changed metadata
cs: Zveřejnit změněná metadata

source: Review and publish changed metadata
cs: Zkontrolovat a zveřejnit změněná metadata

source: Changed metadata submitted for review
cs: Změněná metadata odeslána ke kontrole

source: Accepted changed metadata publication
cs: Přijato zveřejnění změněných metadat

source: Declined changed metadata publication
cs: Zamítnuto zveřejnění změněných metadat

source: Cancelled changed metadata publication
cs: Zrušeno zveřejnění změněných metadat

source: By submitting the changed metadata for review you are requesting the publication of the changed metadata. The draft will become locked and no further changes will be possible until the request is accepted or declined. You will be notified about the decision by email.
cs: Odesláním změněných metadat ke kontrole žádáte o jejich publikování. Koncept bude uzamčen a nebude možné provádět další změny, dokud nebude žádost schválena nebo zamítnuta. O rozhodnutí budete informováni e-mailem.

source: Click to immediately publish the changed metadata. The draft will be a subject to embargo as requested in the side panel. Note: The action is irreversible.
cs: Kliknutím okamžitě publikujete změněná metadata. Koncept bude podléhat embargu podle nastavení v postranním panelu. Poznámka: Tato akce je nevratná.

source: Submit for review. After submitting the changed metadata for review, it will be locked and no further modifications will be possible.
cs: Odeslat ke kontrole. Po odeslání bude záznam uzamčen a nebude možné jej dále upravovat.

source: The record with changed metadata has been submitted for review. You can now accept or decline the request.
cs: Záznam se změněnými metadaty byl odeslán ke kontrole. Nyní můžete žádost schválit nebo zamítnout.

source: The record with changed metadata has been submitted for review. It is now locked and no further changes are possible. You will be notified about the decision by email.
cs: Záznam se změněnými metadaty byl odeslán ke kontrole. Nyní je uzamčen a není možné provádět další změny. O rozhodnutí budete informováni e-mailem.

source: The record with changed metadata has been submitted for review.
cs: Záznam se změněnými metadaty byl odeslán ke kontrole.

source: Waiting for finishing the changed metadata publication request.
cs: Čeká se na vyřízení žádosti o publikaci změněných metadat.

source: Review and publish draft
cs: Zkontrolovat a zveřejnit koncept

source: Draft submitted for review
cs: Koncept odeslán ke kontrole

source: Draft published
cs: Koncept zveřejněn

source: Draft publication declined
cs: Zveřejnění konceptu zamítnuto

source: Draft publication cancelled
cs: Zveřejnění konceptu zrušeno

source: The draft has been submitted for review.
cs: Koncept byl odeslán ke kontrole.

source: The draft has been published.
cs: Koncept byl zveřejněn.

source: Publication of the draft has been declined.
cs: Zveřejnění konceptu bylo zamítnuto.

source: The draft has been cancelled.
cs: Koncept byl zrušen.
