Repository: pypi-data/pypi-mirror-375
Catalog: packages/skip-django-auth-token/skip_django_auth_token-0.5.5-py3-none-any.whl/auth_token/locale/*/LC_MESSAGES/django.po
Languages: cs

source: Second factor authorization
cs: Druhý faktor autorizace

source: Please insert code for second factor authorization
cs: Prosím vložte kód pro druhý faktor autorizace

source: Continue with Microsoft account
cs: Pokračovat pomocí účtu Microsoft

source: Please enter a correct %(username)s and password. Note that both fields may be case-sensitive.
cs: Vložte prosím správné %(username)s a heslo. Obě pole rozlišují velká a malá písmena.

source: This account is inactive.
cs: Tento účet je neaktivní.

source: Password
cs: Heslo

source: Remember user
cs: Zapamatovat uživatele

source: Missing data
cs: Chybějící údaje

source: code
cs: kód

source: The inserted value does not correspond to the sent code.
cs: Vložená hodnota neodpovídá zaslanému kódu.

source: Microsoft SSO login was unsuccessful, please try it again
cs: Přihlášení pomocí Microsoft účtu bylo neúspěšné, prosím zkuste to znovu

source: Microsoft SSO login was unsuccessful, please use another login method
cs: Přihlášení pomocí Microsoft účtu bylo neúspěšné, prosím zkuste jiný způsob přihlášení

source: Invalid authorization token.
cs: Neplatný autorizační kód.

source: Username
cs: Uživatelské jméno

source: Permanent
cs: Zapamatovat uživatele

source: Unable to log in with provided credentials.
cs: Pro zadané údaje není možné uživatele přihlásit.

source: Must include "username" and "password".
cs: Musí obsahovat "uživatelské jméno" a "heslo".

source: device UUID
cs: UUID zařízení

source: Device Token
cs: Kód zařízení

source: Must include "uuid" and "token".
cs: Musí obsahovat "uuid" a "kód".

source: Device key was already registered.
cs: Klíč zařízení je již zaregistrován.

source: granted
cs: uděleno

source: denied
cs: zamítnuto

source: cancelled
cs: zrušeno

source: waiting
cs: čeká

source: expired
cs: expirováno

source: key
cs: klíč

source: user
cs: uživatel

source: is active
cs: je aktivní

source: expires at
cs: datum a čas expirace

source: is allowed cookie
cs: povoleno cookie

source: is allowed header
cs: povoleny hlavičky

source: is authenticated
cs: ověřený

source: preserve cookie
cs: zachovat cookie

source: mobile device
cs: mobilní zařízení

source: authorization token
cs: autorizační token

source: authorization tokens
cs: autorizační tokeny

source: authorization takeover
cs: převzetí přihlášení

source: authorization takeovers
cs: převzetí přihlášení

source: name
cs: jméno

source: last login
cs: poslední přihlášení

source: login token
cs: přihlašovací token

source: is primary
cs: primární

source: mobile devices
cs: mobilní zařízení

source: one time password
cs: jednorázové heslo

source: one time passwords
cs: jednorázová hesla

source: title
cs: název

source: description
cs: popis

source: result
cs: výsledek

source: granted at
cs: datum a čas udělení

source: authorization request
cs: žádost o autorizaci

source: authorization requests
cs: žádosti o autorizace
