Repository: pypi-data/pypi-mirror-375
Catalog: packages/collective.timestamp/collective_timestamp-1.5.tar.gz/collective_timestamp-1.5/src/collective/timestamp/locales/*/LC_MESSAGES/collective.timestamp.po
Languages: fr

source: 0 second (exact)
fr: 0 seconde (exact)

source: Back to content
fr: Retourner vers le contenu

source: Certificate Chain
fr: Chaîne de certificats

source: Choose the hashing algorithm that will be used for generating timestamps.
fr: Choisissez l'algorithme de hachage qui sera utilisé pour générer les horodatages.

source: Click to timestamp this content.
fr: Cliquez pour horodater ce contenu.

source: Content Not Timestamped
fr: Le contenu n'est pas horodaté

source: Detailed information about the timestamping of this content.
fr: Informations détaillées sur l'horodatage de ce contenu.

source: Enable timestamping
fr: Activer l'horodatage

source: Hash Algorithm
fr: Algorithme de hachage

source: Hashed Message
fr: Hash du message

source: Hashing algorithm to use for timestamping
fr: Algorithme de hachage à utiliser pour l'horodatage

source: If enabled, additional timestamping services will be used if the main service is unavailable.
fr: Si activé, des services d'horodatage supplémentaires seront utilisés si le service principal n'est pas disponible.

source: Initial backoff time in seconds
fr: Temps d'attente initial en secondes.

source: Issuer CN
fr: Émetteur CN

source: List of failover timestamping service URLs
fr: Liste des URL de services d'horodatage de secours

source: Maximum number of retries for timestamping
fr: Maximum de tentatives pour l'horodatage

source: More about timestamping
fr: Plus d'informations sur l'horodatage

source: Not specified
fr: Non spécifié

source: Serial
fr: Numéro de série

source: Subject CN
fr: Sujet CN

source: The initial time to wait before retrying a failed timestamping attempt.
fr: Le temps initial à attendre avant de réessayer une tentative d'horodatage échouée. Ce paramètre est utilisé pour éviter de surcharger le service d'horodatage en cas d'échec.<br>L'algorithme de backoff exponentiel est utilisé pour augmenter progressivement le temps d'attente entre les tentatives.

source: The maximum number of attempts to retry timestamping in case of failure.
fr: Le nombre maximum de tentatives supplémentaires pour réessayer l'horodatage en cas d'échec.

source: These services will be used if the main service is unavailable.
fr: Ces services seront utilisés si le service principal n'est pas disponible.

source: This allows you to disable timestamping for this specific content.
fr: Ceci vous permet de désactiver l'horodatage pour cette publication.

source: This content is not timestamped.
fr: Ce contenu n'est pas horodaté

source: Time Stamp Response (TSR) file
fr: Fichier d'horodatage (TSR)

source: Timestamp
fr: Horodater

source: Timestamp Authority (TSA)
fr: Autorité d'horodatage (TSA)

source: Timestamp Information
fr: Informations d'horodatage

source: Timestamp file has been successfully generated and saved
fr: L'horodatage a bien été effectué.

source: Timestamp file has been successfully generated and saved for ${name}
fr: L'horodatage a bien été effectué pour ${name}.

source: Timestamp has failed.
fr: L'horodatage a échoué.

source: Timestamp information has been removed since the data has changed
fr: L'horodatage a été retiré car les données ont changé

source: Timestamp object
fr: Horodater le contenu

source: Timestamp the triggering item
fr: Horodater l'élément déclencheur

source: Timestamped
fr: Horodaté

source: Timestamped file
fr: Fichier horodaté

source: Timestamped item
fr: Élément horodaté

source: Timestamped on
fr: Horodaté le

source: Timestamping settings
fr: Paramètres d'horodatage

source: Timestamping support for Plone content types
fr: Support de l'horodatage pour les types de contenus Plone

source: URL of the documentation explaining how to verify timestamps
fr: Adresse URL de la documentation expliquant comment vérifier les horodatages

source: URL of the timestamping service you want to use
fr: Adresse URL du service d'horodatage que vous souhaitez utiliser

source: Unable to timestamp ${name}: ${error}
fr: Incapable d'horodater ${name}: ${error}

source: Uninstalls collective.timestamp
fr: Désinstalle collective.timestamp

source: Use failover timestamping
fr: Utiliser l'horodatage de secours

source: Valid From
fr: Valide depuis

source: Valid To
fr: Valide jusqu'à

source: You are editing a timestamped content. Your modifications can invalidate the timestamp.
fr: Vous éditez un contenu horodaté. Vos modifications peuvent invalider l'horodatage.

source: label_common_name
fr: Nom commun

source: label_country_name
fr: Pays

source: label_domain_component
fr: Composant du domaine

source: label_email_address
fr: Adresse e-mail

source: label_general_name
fr: Nom général

source: label_locality_name
fr: Localité

source: label_organization_identifier
fr: Identifiant de l'organisation

source: label_organization_name
fr: Organisation

source: label_organizational_unit_name
fr: Unité organisationnelle

source: label_serial_number
fr: Numéro de série

source: label_state_province_name
fr: Province / État

source: {} second(s)
fr: {} seconde(s)
